wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_rcu.h
/* RCU_AHBRST */
#define RCU_AHBEN_USBFSRST              BIT(12)                   /*!< USBFS reset */
#define RCU_AHBEN_CAURST                BIT(16)                   /*!< CAU reset */
#define RCU_AHBEN_HAURST                BIT(17)                   /*!< HAU reset */
#define RCU_AHBEN_TRNGRST               BIT(18)                   /*!< TRNG reset */
#define RCU_AHBEN_DMAMUXRST             BIT(19)                   /*!< DMAMUXEN reset */
#define RCU_AHBEN_DMA0RST               BIT(20)                   /*!< DMA0 reset */
#define RCU_AHBEN_DMA1RST               BIT(21)                   /*!< DMA1 reset */

/* RCU_CFG1 */
#define RCU_CFG1_PREDIV0                BITS(0,3)                /*!< PREDIV0 division factor */
#define RCU_CFG1_PREDIV1                BITS(4,7)                /*!< PREDIV1 division factor */
#define RCU_CFG1_PLL1MF                 BITS(8,13)               /*!< PLL1 clock multiplication factor */
#define RCU_CFG1_PLL1SEL                BIT(16)                  /*!< PLL1 input clock source selection */
#define RCU_CFG1_I2S1SEL                BIT(17)                  /*!< I2S1 clock source selection */
#define RCU_CFG1_I2S2SEL                BIT(18)                  /*!< I2S2 clock source selection  */
#define RCU_CFG1_HXTALRDYRST            BIT(19)                  /*!< HXTAL ready reset */
#define RCU_CFG1_PLL0SEL                BITS(20,21)              /*!< PLL0 input clock source selection */
#define RCU_CFG1_IRC40KCALIB            BITS(24,28)              /*!< internal 40KHz RC oscillator calibration value register */
#define RCU_CFG1_ADCPSC_3               BIT(29)                  /*!< bit 4 of ADCPSC */

/* RCU_PLLBWCFG */
#define RCU_PLLBWCFG_PLL0_BW_CFG        BITS(0,3)                 /*!< PLL0 bandwidth configuration */
#define RCU_PLLBWCFG_PLL1_BW_CFG        BITS(8,11)                /*!< PLL1 bandwidth configuration */

/* RCU_DSV */
#define RCU_DSV_SWDLY                   BITS(16,20)               /*!< switch delay time */
#define RCU_DSV_DSLPVS                  BITS(0,2)                 /*!< deep-sleep mode voltage select */

/* RCU_CKFMCFG0 */
#define RCU_CKFMCFG0_IRC8MCKFMEN        BIT(0)                    /*!< IRC8M clock frequency monitor enable */
#define RCU_CKFMCFG0_IRC8MCKFMC         BITS(1,2)                 /*!< IRC8M clock frequency monitor configuration */
#define RCU_CKFMCFG0_IRC8MCKFFF         BIT(3)                    /*!< IRC8M clock frequency failure flag */
#define RCU_CKFMCFG0_IRC8MCKFFC         BIT(4)                    /*!< IRC8M clock frequency failure flag clear */
#define RCU_CKFMCFG0_IRC8MCKFFIE        BIT(5)                    /*!< IRC8M clock frequency failure interrupt enable */

/* RCU_CKFMCFG1 */
#define RCU_CKFMCFG1_HXTALCKFMEN        BIT(0)                    /*!< HXTAL clock frequency monitor enable */
#define RCU_CKFMCFG1_HXTALCKFMAX        BITS(1,12)                /*!< HXTAL clock frequency monitor configuration maximum value*/
#define RCU_CKFMCFG1_HXTALCKFMIN        BITS(13,24)               /*!< HXTAL clock frequency monitor configuration minimum value */
#define RCU_CKFMCFG1_HXTALCKFFIE        BIT(25)                   /*!< HXTAL clock frequency failure interrupt enable */
#define RCU_CKFMCFG1_HXTALCKFFF         BIT(30)                   /*!< HXTAL clock frequency failure flag */
#define RCU_CKFMCFG1_HXTALCKFFC         BIT(31)                   /*!< HXTAL clock frequency failure flag clear */

/* RCU_CKFMCFG2 */
#define RCU_CKFMCFG2_PLL0PCKFMEN        BIT(0)                    /*!< PLL0P clock frequency monitor enable */
#define RCU_CKFMCFG2_PLL0PCKFMAX        BITS(1,10)                /*!< PLL0P clock frequency monitor configuration maximum value */
#define RCU_CKFMCFG2_PLL0PCKFMIN        BITS(12,21)               /*!< PLL0P clock frequency monitor configuration minimum value */
#define RCU_CKFMCFG2_PLL0PCKFFIE        BIT(23)                   /*!< PLL0P clock frequency failure interrupt enable */
#define RCU_CKFMCFG2_PLL0PCKFFF         BIT(30)                   /*!< PLL0P clock frequency failure flag */
#define RCU_CKFMCFG2_PLL0PCKFFC         BIT(31)                   /*!< PLL0P clock frequency failure flag clear */

/* RCU_CKFMCFG3 */
#define RCU_CKFMCFG3_PLL1CKFMEN         BIT(0)                    /*!< PLL1 clock frequency monitor enable */
#define RCU_CKFMCFG3_PLL1CKFMAX         BITS(1,10)                /*!< PLL1 clock frequency monitor configuration maximum value */
#define RCU_CKFMCFG3_PLL1CKFMIN         BITS(12,21)               /*!< PLL1 clock frequency monitor configuration minimum value */
#define RCU_CKFMCFG3_PLL1CKFFIE         BIT(23)                   /*!< PLL1 clock frequency failure interrupt enable */
#define RCU_CKFMCFG3_PLL1CKFFF          BIT(30)                   /*!< PLL1 clock frequency failure flag */
#define RCU_CKFMCFG3_PLL1CKFFC          BIT(31)                   /*!< PLL1 clock frequency failure flag clear */

/* RCU_ADDCTL */
#define RCU_ADDCTL_CK48MSEL             BIT(0)                    /*!< 48MHz clock selection */
#define RCU_ADDCTL_FMCSEL               BITS(1,2)                 /*!< FMC clock  selection */
#define RCU_ADDCTL_I2S1DIV              BITS(3,7)                 /*!< I2S1 clock prescaler selection */
#define RCU_ADDCTL_PLL0DIV              BITS(8,11)                /*!< PLL0 clock prescaler selection */
#define RCU_ADDCTL_FMCDIV               BITS(12,15)               /*!< FMC clock prescaler selection */
#define RCU_ADDCTL_IRC48MEN             BIT(16)                   /*!< internal 48MHz RC oscillator enable */
#define RCU_ADDCTL_IRC48MSTB            BIT(17)                   /*!< internal 48MHz RC oscillator clock stabilization flag */
#define RCU_ADDCTL_I2S2DIV              BITS(18,22)               /*!< I2S2 clock prescaler selection */
#define RCU_ADDCTL_IRC48MCAL            BITS(24,31)               /*!< internal 48MHz RC oscillator calibration value register */

/* RCU_ADDINT */
#define RCU_ADDINT_IRC48MSTBIF          BIT(6)                    /*!< IRC48M stabilization interrupt flag */
#define RCU_ADDINT_IRC48MSTBIE          BIT(14)                   /*!< internal 48 MHz RC oscillator stabilization interrupt enable */
#define RCU_ADDINT_IRC48MSTBIC          BIT(22)                   /*!< internal 48 MHz RC oscillator stabilization interrupt clear */

/* RCU_ADDAPB1RST */
#define RCU_ADDAPB1RST_CTCRST           BIT(27)                   /*!< CTC reset */

/* RCU_ADDAPB1EN */
#define RCU_ADDAPB1EN_CTCEN             BIT(27)                   /*!< CTC clock enable */

/* RCU_LOCKREG */
#define RCU_LOCK_LOCK                   BIT(31)                   /*!< RCU register lock bit */

/* constants definitions */
/* define the peripheral clock enable bit position and its register index offset */
#define RCU_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define RCU_REG_VAL(periph)             (REG32(RCU + ((uint32_t)(periph) >> 6)))
#define RCU_BIT_POS(val)                ((uint32_t)(val) & 0x1FU)

/* register offset */
/* peripherals enable */
#define AHBEN_REG_OFFSET                0x14U                     /*!< AHB enable register offset */
#define APB1EN_REG_OFFSET               0x1CU                     /*!< APB1 enable register offset */
#define APB2EN_REG_OFFSET               0x18U                     /*!< APB2 enable register offset */
#define ADD_APB1EN_REG_OFFSET           0xE4U                     /*!< APB1 additional enable register offset */

