wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_rcu.h
/* PLL0 clock multiplication factor */
#define CFG0_PLL0MF(regval)             ((BITS(18,21) & ((uint32_t)((uint32_t)(regval) & 0x0FU) << 18U)) | (BITS(29,30) & ((uint32_t)((uint32_t)(regval) & 0x30U) << 25U)))
#define RCU_PLL0_MUL4                   CFG0_PLL0MF(4)                      /*!< PLL0 source clock multiply by 4 */
#define RCU_PLL0_MUL5                   CFG0_PLL0MF(5)                      /*!< PLL0 source clock multiply by 5 */
#define RCU_PLL0_MUL6                   CFG0_PLL0MF(6)                      /*!< PLL0 source clock multiply by 6 */
#define RCU_PLL0_MUL7                   CFG0_PLL0MF(7)                      /*!< PLL0 source clock multiply by 7 */
#define RCU_PLL0_MUL8                   CFG0_PLL0MF(8)                      /*!< PLL0 source clock multiply by 8 */
#define RCU_PLL0_MUL9                   CFG0_PLL0MF(9)                      /*!< PLL0 source clock multiply by 9 */
#define RCU_PLL0_MUL10                  CFG0_PLL0MF(10)                     /*!< PLL0 source clock multiply by 10 */
#define RCU_PLL0_MUL11                  CFG0_PLL0MF(11)                     /*!< PLL0 source clock multiply by 11 */
#define RCU_PLL0_MUL12                  CFG0_PLL0MF(12)                     /*!< PLL0 source clock multiply by 12 */
#define RCU_PLL0_MUL13                  CFG0_PLL0MF(13)                     /*!< PLL0 source clock multiply by 13 */
#define RCU_PLL0_MUL14                  CFG0_PLL0MF(14)                     /*!< PLL0 source clock multiply by 14 */
#define RCU_PLL0_MUL15                  CFG0_PLL0MF(15)                     /*!< PLL0 source clock multiply by 15 */
#define RCU_PLL0_MUL16                  CFG0_PLL0MF(16)                     /*!< PLL0 source clock multiply by 16 */
#define RCU_PLL0_MUL17                  CFG0_PLL0MF(17)                     /*!< PLL0 source clock multiply by 17 */
#define RCU_PLL0_MUL18                  CFG0_PLL0MF(18)                     /*!< PLL0 source clock multiply by 18 */
#define RCU_PLL0_MUL19                  CFG0_PLL0MF(19)                     /*!< PLL0 source clock multiply by 19 */
#define RCU_PLL0_MUL20                  CFG0_PLL0MF(20)                     /*!< PLL0 source clock multiply by 20 */
#define RCU_PLL0_MUL21                  CFG0_PLL0MF(21)                     /*!< PLL0 source clock multiply by 21 */
#define RCU_PLL0_MUL22                  CFG0_PLL0MF(22)                     /*!< PLL0 source clock multiply by 22 */
#define RCU_PLL0_MUL23                  CFG0_PLL0MF(23)                     /*!< PLL0 source clock multiply by 23 */
#define RCU_PLL0_MUL24                  CFG0_PLL0MF(24)                     /*!< PLL0 source clock multiply by 24 */
#define RCU_PLL0_MUL25                  CFG0_PLL0MF(25)                     /*!< PLL0 source clock multiply by 25 */
#define RCU_PLL0_MUL26                  CFG0_PLL0MF(26)                     /*!< PLL0 source clock multiply by 26 */
#define RCU_PLL0_MUL27                  CFG0_PLL0MF(27)                     /*!< PLL0 source clock multiply by 27 */
#define RCU_PLL0_MUL28                  CFG0_PLL0MF(28)                     /*!< PLL0 source clock multiply by 28 */
#define RCU_PLL0_MUL29                  CFG0_PLL0MF(29)                     /*!< PLL0 source clock multiply by 29 */
#define RCU_PLL0_MUL30                  CFG0_PLL0MF(30)                     /*!< PLL0 source clock multiply by 30 */
#define RCU_PLL0_MUL31                  CFG0_PLL0MF(31)                     /*!< PLL0 source clock multiply by 31 */
#define RCU_PLL0_MUL32                  CFG0_PLL0MF(32)                     /*!< PLL0 source clock multiply by 32 */
#define RCU_PLL0_MUL33                  CFG0_PLL0MF(33)                     /*!< PLL0 source clock multiply by 33 */
#define RCU_PLL0_MUL34                  CFG0_PLL0MF(34)                     /*!< PLL0 source clock multiply by 34 */
#define RCU_PLL0_MUL35                  CFG0_PLL0MF(35)                     /*!< PLL0 source clock multiply by 35 */
#define RCU_PLL0_MUL36                  CFG0_PLL0MF(36)                     /*!< PLL0 source clock multiply by 36 */
#define RCU_PLL0_MUL37                  CFG0_PLL0MF(37)                     /*!< PLL0 source clock multiply by 37 */
#define RCU_PLL0_MUL38                  CFG0_PLL0MF(38)                     /*!< PLL0 source clock multiply by 38 */
#define RCU_PLL0_MUL39                  CFG0_PLL0MF(39)                     /*!< PLL0 source clock multiply by 39 */
#define RCU_PLL0_MUL40                  CFG0_PLL0MF(40)                     /*!< PLL0 source clock multiply by 40 */
#define RCU_PLL0_MUL41                  CFG0_PLL0MF(41)                     /*!< PLL0 source clock multiply by 41 */
#define RCU_PLL0_MUL42                  CFG0_PLL0MF(42)                     /*!< PLL0 source clock multiply by 42 */
#define RCU_PLL0_MUL43                  CFG0_PLL0MF(43)                     /*!< PLL0 source clock multiply by 43 */
#define RCU_PLL0_MUL44                  CFG0_PLL0MF(44)                     /*!< PLL0 source clock multiply by 44 */
#define RCU_PLL0_MUL45                  CFG0_PLL0MF(45)                     /*!< PLL0 source clock multiply by 45 */
#define RCU_PLL0_MUL46                  CFG0_PLL0MF(46)                     /*!< PLL0 source clock multiply by 46 */
#define RCU_PLL0_MUL47                  CFG0_PLL0MF(47)                     /*!< PLL0 source clock multiply by 47 */
#define RCU_PLL0_MUL48                  CFG0_PLL0MF(48)                     /*!< PLL0 source clock multiply by 48 */
#define RCU_PLL0_MUL49                  CFG0_PLL0MF(49)                     /*!< PLL0 source clock multiply by 49 */
#define RCU_PLL0_MUL50                  CFG0_PLL0MF(50)                     /*!< PLL0 source clock multiply by 50 */
#define RCU_PLL0_MUL51                  CFG0_PLL0MF(51)                     /*!< PLL0 source clock multiply by 51 */
#define RCU_PLL0_MUL52                  CFG0_PLL0MF(52)                     /*!< PLL0 source clock multiply by 52 */
#define RCU_PLL0_MUL53                  CFG0_PLL0MF(53)                     /*!< PLL0 source clock multiply by 53 */
#define RCU_PLL0_MUL54                  CFG0_PLL0MF(54)                     /*!< PLL0 source clock multiply by 54 */
#define RCU_PLL0_MUL55                  CFG0_PLL0MF(55)                     /*!< PLL0 source clock multiply by 55 */
#define RCU_PLL0_MUL56                  CFG0_PLL0MF(56)                     /*!< PLL0 source clock multiply by 56 */
#define RCU_PLL0_MUL57                  CFG0_PLL0MF(57)                     /*!< PLL0 source clock multiply by 57 */
#define RCU_PLL0_MUL58                  CFG0_PLL0MF(58)                     /*!< PLL0 source clock multiply by 58 */
#define RCU_PLL0_MUL59                  CFG0_PLL0MF(59)                     /*!< PLL0 source clock multiply by 59 */
#define RCU_PLL0_MUL60                  CFG0_PLL0MF(60)                     /*!< PLL0 source clock multiply by 60 */
#define RCU_PLL0_MUL61                  CFG0_PLL0MF(61)                     /*!< PLL0 source clock multiply by 61 */
#define RCU_PLL0_MUL62                  CFG0_PLL0MF(62)                     /*!< PLL0 source clock multiply by 62 */
#define RCU_PLL0_MUL63                  CFG0_PLL0MF(63)                     /*!< PLL0 source clock multiply by 63 */

/* USBFS prescaler select */
#define USBPSC_2                        RCU_CFG0_USBFSPSC_2
#define CFG0_USBPSC(regval)             (BITS(22,23) & ((uint32_t)(regval) << 22U))
#define RCU_CKUSB_CKPLL0_DIV2           CFG0_USBPSC(1)                      /*!< USBFS prescaler select CK_PLL0/2 */
#define RCU_CKUSB_CKPLL0_DIV3           CFG0_USBPSC(0)                      /*!< USBFS prescaler select CK_PLL0/3 */
#define RCU_CKUSB_CKPLL0_DIV4           CFG0_USBPSC(3)                      /*!< USBFS prescaler select CK_PLL0/4 */
#define RCU_CKUSB_CKPLL0_DIV5           CFG0_USBPSC(2)                      /*!< USBFS prescaler select CK_PLL0/5 */
#define RCU_CKUSB_CKPLL0_DIV6           (USBPSC_2 | CFG0_USBPSC(0))         /*!< USBFS prescaler select CK_PLL0/6 */
#define RCU_CKUSB_CKPLL0_DIV7           (USBPSC_2 | CFG0_USBPSC(1))         /*!< USBFS prescaler select CK_PLL0/7 */
#define RCU_CKUSB_CKPLL0_DIV8           (USBPSC_2 | CFG0_USBPSC(2))         /*!< USBFS prescaler select CK_PLL0/8 */

/* CKOUT Clock source selection */
#define CFG0_CKOUTSEL(regval)           (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_CKOUTSRC_CKSYS              CFG0_CKOUTSEL(0)                   /*!< system clock selected */
#define RCU_CKOUTSRC_IRC8M              CFG0_CKOUTSEL(1)                   /*!< internal 8M RC oscillator clock selected */
#define RCU_CKOUTSRC_HXTAL              CFG0_CKOUTSEL(2)                   /*!< high speed crystal oscillator clock (HXTAL) selected */
#define RCU_CKOUTSRC_CKPLL0_DIV2        CFG0_CKOUTSEL(3)                   /*!< CK_PLL0/2 clock selected */
#define RCU_CKOUTSRC_CKPLL1_DIV2        CFG0_CKOUTSEL(4)                   /*!< CK_PLL1/2 clock selected */
#define RCU_CKOUTSRC_LXTAL              CFG0_CKOUTSEL(5)                   /*!< LXTAL clock selected */
#define RCU_CKOUTSRC_IRC48M             CFG0_CKOUTSEL(6)                   /*!< internal 8M RC oscillator clock selected  */
#define RCU_CKOUTSRC_IRC40K             CFG0_CKOUTSEL(7)                   /*!< IRC40K clock selected */

/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)          (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define RCU_LXTAL_LOWDRI                BDCTL_LXTALDRI(0)                   /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI            BDCTL_LXTALDRI(1)                   /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI           BDCTL_LXTALDRI(2)                   /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI               BDCTL_LXTALDRI(3)                   /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)            (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE                 BDCTL_RTCSRC(0)                     /*!< no clock selected */
#define RCU_RTCSRC_LXTAL                BDCTL_RTCSRC(1)                     /*!< RTC source clock select LXTAL  */
#define RCU_RTCSRC_IRC40K               BDCTL_RTCSRC(2)                     /*!< RTC source clock select IRC40K */
#define RCU_RTCSRC_HXTAL_DIV_128        BDCTL_RTCSRC(3)                     /*!< RTC source clock select HXTAL/128 */

/* PREDIV0 division factor */
#define CFG1_PREDIV0(regval)            (BITS(0,3) & ((uint32_t)(regval) << 0U))
#define RCU_PREDIV0_DIV1                CFG1_PREDIV0(0)                     /*!< PREDIV0 input source clock not divided */
#define RCU_PREDIV0_DIV2                CFG1_PREDIV0(1)                     /*!< PREDIV0 input source clock divided by 2 */
#define RCU_PREDIV0_DIV3                CFG1_PREDIV0(2)                     /*!< PREDIV0 input source clock divided by 3 */
#define RCU_PREDIV0_DIV4                CFG1_PREDIV0(3)                     /*!< PREDIV0 input source clock divided by 4 */
#define RCU_PREDIV0_DIV5                CFG1_PREDIV0(4)                     /*!< PREDIV0 input source clock divided by 5 */
#define RCU_PREDIV0_DIV6                CFG1_PREDIV0(5)                     /*!< PREDIV0 input source clock divided by 6 */
#define RCU_PREDIV0_DIV7                CFG1_PREDIV0(6)                     /*!< PREDIV0 input source clock divided by 7 */
#define RCU_PREDIV0_DIV8                CFG1_PREDIV0(7)                     /*!< PREDIV0 input source clock divided by 8 */
#define RCU_PREDIV0_DIV9                CFG1_PREDIV0(8)                     /*!< PREDIV0 input source clock divided by 9 */
#define RCU_PREDIV0_DIV10               CFG1_PREDIV0(9)                     /*!< PREDIV0 input source clock divided by 10 */
#define RCU_PREDIV0_DIV11               CFG1_PREDIV0(10)                    /*!< PREDIV0 input source clock divided by 11 */
#define RCU_PREDIV0_DIV12               CFG1_PREDIV0(11)                    /*!< PREDIV0 input source clock divided by 12 */
#define RCU_PREDIV0_DIV13               CFG1_PREDIV0(12)                    /*!< PREDIV0 input source clock divided by 13 */
#define RCU_PREDIV0_DIV14               CFG1_PREDIV0(13)                    /*!< PREDIV0 input source clock divided by 14 */
#define RCU_PREDIV0_DIV15               CFG1_PREDIV0(14)                    /*!< PREDIV0 input source clock divided by 15 */
#define RCU_PREDIV0_DIV16               CFG1_PREDIV0(15)                    /*!< PREDIV0 input source clock divided by 16 */

