wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_rcu.h
/* PREDIV1 division factor */
#define CFG1_PREDIV1(regval)            (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define RCU_PREDIV1_DIV1                CFG1_PREDIV1(0)                     /*!< PREDIV1 input source clock not divided */
#define RCU_PREDIV1_DIV2                CFG1_PREDIV1(1)                     /*!< PREDIV1 input source clock divided by 2 */
#define RCU_PREDIV1_DIV3                CFG1_PREDIV1(2)                     /*!< PREDIV1 input source clock divided by 3 */
#define RCU_PREDIV1_DIV4                CFG1_PREDIV1(3)                     /*!< PREDIV1 input source clock divided by 4 */
#define RCU_PREDIV1_DIV5                CFG1_PREDIV1(4)                     /*!< PREDIV1 input source clock divided by 5 */
#define RCU_PREDIV1_DIV6                CFG1_PREDIV1(5)                     /*!< PREDIV1 input source clock divided by 6 */
#define RCU_PREDIV1_DIV7                CFG1_PREDIV1(6)                     /*!< PREDIV1 input source clock divided by 7 */
#define RCU_PREDIV1_DIV8                CFG1_PREDIV1(7)                     /*!< PREDIV1 input source clock divided by 8 */
#define RCU_PREDIV1_DIV9                CFG1_PREDIV1(8)                     /*!< PREDIV1 input source clock divided by 9 */
#define RCU_PREDIV1_DIV10               CFG1_PREDIV1(9)                     /*!< PREDIV1 input source clock divided by 10 */
#define RCU_PREDIV1_DIV11               CFG1_PREDIV1(10)                    /*!< PREDIV1 input source clock divided by 11 */
#define RCU_PREDIV1_DIV12               CFG1_PREDIV1(11)                    /*!< PREDIV1 input source clock divided by 12 */
#define RCU_PREDIV1_DIV13               CFG1_PREDIV1(12)                    /*!< PREDIV1 input source clock divided by 13 */
#define RCU_PREDIV1_DIV14               CFG1_PREDIV1(13)                    /*!< PREDIV1 input source clock divided by 14 */
#define RCU_PREDIV1_DIV15               CFG1_PREDIV1(14)                    /*!< PREDIV1 input source clock divided by 15 */
#define RCU_PREDIV1_DIV16               CFG1_PREDIV1(15)                    /*!< PREDIV1 input source clock divided by 16 */

/* PLL1 clock multiplication factor */
#define CFG1_PLL1MF(regval)             (BITS(8,13) & ((uint32_t)(regval) << 8U))
#define RCU_PLL1_MUL4                    CFG1_PLL1MF(4)                     /*!< PLL1 source clock multiply by 4 */
#define RCU_PLL1_MUL5                    CFG1_PLL1MF(5)                     /*!< PLL1 source clock multiply by 5 */
#define RCU_PLL1_MUL6                    CFG1_PLL1MF(6)                     /*!< PLL1 source clock multiply by 6 */
#define RCU_PLL1_MUL7                    CFG1_PLL1MF(7)                     /*!< PLL1 source clock multiply by 7 */
#define RCU_PLL1_MUL8                    CFG1_PLL1MF(8)                     /*!< PLL1 source clock multiply by 8 */
#define RCU_PLL1_MUL9                    CFG1_PLL1MF(9)                     /*!< PLL1 source clock multiply by 9 */
#define RCU_PLL1_MUL10                   CFG1_PLL1MF(10)                    /*!< PLL1 source clock multiply by 10 */
#define RCU_PLL1_MUL11                   CFG1_PLL1MF(11)                    /*!< PLL1 source clock multiply by 11 */
#define RCU_PLL1_MUL12                   CFG1_PLL1MF(12)                    /*!< PLL1 source clock multiply by 12 */
#define RCU_PLL1_MUL13                   CFG1_PLL1MF(13)                    /*!< PLL1 source clock multiply by 13 */
#define RCU_PLL1_MUL14                   CFG1_PLL1MF(14)                    /*!< PLL1 source clock multiply by 14 */
#define RCU_PLL1_MUL15                   CFG1_PLL1MF(15)                    /*!< PLL1 source clock multiply by 15 */
#define RCU_PLL1_MUL16                   CFG1_PLL1MF(16)                    /*!< PLL1 source clock multiply by 16 */
#define RCU_PLL1_MUL17                   CFG1_PLL1MF(17)                    /*!< PLL1 source clock multiply by 17 */
#define RCU_PLL1_MUL18                   CFG1_PLL1MF(18)                    /*!< PLL1 source clock multiply by 18 */
#define RCU_PLL1_MUL19                   CFG1_PLL1MF(19)                    /*!< PLL1 source clock multiply by 19 */
#define RCU_PLL1_MUL20                   CFG1_PLL1MF(20)                    /*!< PLL1 source clock multiply by 20 */
#define RCU_PLL1_MUL21                   CFG1_PLL1MF(21)                    /*!< PLL1 source clock multiply by 21 */
#define RCU_PLL1_MUL22                   CFG1_PLL1MF(22)                    /*!< PLL1 source clock multiply by 22 */
#define RCU_PLL1_MUL23                   CFG1_PLL1MF(23)                    /*!< PLL1 source clock multiply by 23 */
#define RCU_PLL1_MUL24                   CFG1_PLL1MF(24)                    /*!< PLL1 source clock multiply by 24 */
#define RCU_PLL1_MUL25                   CFG1_PLL1MF(25)                    /*!< PLL1 source clock multiply by 25 */
#define RCU_PLL1_MUL26                   CFG1_PLL1MF(26)                    /*!< PLL1 source clock multiply by 26 */
#define RCU_PLL1_MUL27                   CFG1_PLL1MF(27)                    /*!< PLL1 source clock multiply by 27 */
#define RCU_PLL1_MUL28                   CFG1_PLL1MF(28)                    /*!< PLL1 source clock multiply by 28 */
#define RCU_PLL1_MUL29                   CFG1_PLL1MF(29)                    /*!< PLL1 source clock multiply by 29 */
#define RCU_PLL1_MUL30                   CFG1_PLL1MF(30)                    /*!< PLL1 source clock multiply by 30 */
#define RCU_PLL1_MUL31                   CFG1_PLL1MF(31)                    /*!< PLL1 source clock multiply by 31 */
#define RCU_PLL1_MUL32                   CFG1_PLL1MF(32)                    /*!< PLL1 source clock multiply by 32 */
#define RCU_PLL1_MUL33                   CFG1_PLL1MF(33)                    /*!< PLL1 source clock multiply by 33 */
#define RCU_PLL1_MUL34                   CFG1_PLL1MF(34)                    /*!< PLL1 source clock multiply by 34 */
#define RCU_PLL1_MUL35                   CFG1_PLL1MF(35)                    /*!< PLL1 source clock multiply by 35 */
#define RCU_PLL1_MUL36                   CFG1_PLL1MF(36)                    /*!< PLL1 source clock multiply by 36 */
#define RCU_PLL1_MUL37                   CFG1_PLL1MF(37)                    /*!< PLL1 source clock multiply by 37 */
#define RCU_PLL1_MUL38                   CFG1_PLL1MF(38)                    /*!< PLL1 source clock multiply by 38 */
#define RCU_PLL1_MUL39                   CFG1_PLL1MF(39)                    /*!< PLL1 source clock multiply by 39 */
#define RCU_PLL1_MUL40                   CFG1_PLL1MF(40)                    /*!< PLL1 source clock multiply by 40 */
#define RCU_PLL1_MUL41                   CFG1_PLL1MF(41)                    /*!< PLL1 source clock multiply by 41 */
#define RCU_PLL1_MUL42                   CFG1_PLL1MF(42)                    /*!< PLL1 source clock multiply by 42 */
#define RCU_PLL1_MUL43                   CFG1_PLL1MF(43)                    /*!< PLL1 source clock multiply by 43 */
#define RCU_PLL1_MUL44                   CFG1_PLL1MF(44)                    /*!< PLL1 source clock multiply by 44 */
#define RCU_PLL1_MUL45                   CFG1_PLL1MF(45)                    /*!< PLL1 source clock multiply by 45 */
#define RCU_PLL1_MUL46                   CFG1_PLL1MF(46)                    /*!< PLL1 source clock multiply by 46 */
#define RCU_PLL1_MUL47                   CFG1_PLL1MF(47)                    /*!< PLL1 source clock multiply by 47 */
#define RCU_PLL1_MUL48                   CFG1_PLL1MF(48)                    /*!< PLL1 source clock multiply by 48 */
#define RCU_PLL1_MUL49                   CFG1_PLL1MF(49)                    /*!< PLL1 source clock multiply by 49 */
#define RCU_PLL1_MUL50                   CFG1_PLL1MF(50)                    /*!< PLL1 source clock multiply by 50 */
#define RCU_PLL1_MUL51                   CFG1_PLL1MF(51)                    /*!< PLL1 source clock multiply by 51 */
#define RCU_PLL1_MUL52                   CFG1_PLL1MF(52)                    /*!< PLL1 source clock multiply by 52 */
#define RCU_PLL1_MUL53                   CFG1_PLL1MF(53)                    /*!< PLL1 source clock multiply by 53 */
#define RCU_PLL1_MUL54                   CFG1_PLL1MF(54)                    /*!< PLL1 source clock multiply by 54 */
#define RCU_PLL1_MUL55                   CFG1_PLL1MF(55)                    /*!< PLL1 source clock multiply by 55 */
#define RCU_PLL1_MUL56                   CFG1_PLL1MF(56)                    /*!< PLL1 source clock multiply by 56 */
#define RCU_PLL1_MUL57                   CFG1_PLL1MF(57)                    /*!< PLL1 source clock multiply by 57 */
#define RCU_PLL1_MUL58                   CFG1_PLL1MF(58)                    /*!< PLL1 source clock multiply by 58 */
#define RCU_PLL1_MUL59                   CFG1_PLL1MF(59)                    /*!< PLL1 source clock multiply by 59 */
#define RCU_PLL1_MUL60                   CFG1_PLL1MF(60)                    /*!< PLL1 source clock multiply by 60 */
#define RCU_PLL1_MUL61                   CFG1_PLL1MF(61)                    /*!< PLL1 source clock multiply by 61 */
#define RCU_PLL1_MUL62                   CFG1_PLL1MF(62)                    /*!< PLL1 source clock multiply by 62 */
#define RCU_PLL1_MUL63                   CFG1_PLL1MF(63)                    /*!< PLL1 source clock multiply by 63 */

/* I2S1 clock division factor  */
#define ADDCTL_I2S1DIV(regval)           (BITS(3,7) & ((uint32_t)(regval) << 3U))
#define RCU_I2S1_DIV1                    ADDCTL_I2S1DIV(0)                  /*!< I2S1 input source clock divided by 1  */
#define RCU_I2S1_DIV2                    ADDCTL_I2S1DIV(1)                  /*!< I2S1 input source clock divided by 2  */
#define RCU_I2S1_DIV3                    ADDCTL_I2S1DIV(2)                  /*!< I2S1 input source clock divided by 3  */
#define RCU_I2S1_DIV4                    ADDCTL_I2S1DIV(3)                  /*!< I2S1 input source clock divided by 4  */
#define RCU_I2S1_DIV5                    ADDCTL_I2S1DIV(4)                  /*!< I2S1 input source clock divided by 5  */
#define RCU_I2S1_DIV6                    ADDCTL_I2S1DIV(5)                  /*!< I2S1 input source clock divided by 6  */
#define RCU_I2S1_DIV7                    ADDCTL_I2S1DIV(6)                  /*!< I2S1 input source clock divided by 7  */
#define RCU_I2S1_DIV8                    ADDCTL_I2S1DIV(7)                  /*!< I2S1 input source clock divided by 8  */
#define RCU_I2S1_DIV9                    ADDCTL_I2S1DIV(8)                  /*!< I2S1 input source clock divided by 9  */
#define RCU_I2S1_DIV10                   ADDCTL_I2S1DIV(9)                  /*!< I2S1 input source clock divided by 10  */
#define RCU_I2S1_DIV11                   ADDCTL_I2S1DIV(10)                 /*!< I2S1 input source clock divided by 11  */
#define RCU_I2S1_DIV12                   ADDCTL_I2S1DIV(11)                 /*!< I2S1 input source clock divided by 12  */
#define RCU_I2S1_DIV13                   ADDCTL_I2S1DIV(12)                 /*!< I2S1 input source clock divided by 13  */
#define RCU_I2S1_DIV14                   ADDCTL_I2S1DIV(13)                 /*!< I2S1 input source clock divided by 14  */
#define RCU_I2S1_DIV15                   ADDCTL_I2S1DIV(14)                 /*!< I2S1 input source clock divided by 15  */
#define RCU_I2S1_DIV16                   ADDCTL_I2S1DIV(15)                 /*!< I2S1 input source clock divided by 16  */
#define RCU_I2S1_DIV17                   ADDCTL_I2S1DIV(16)                 /*!< I2S1 input source clock divided by 17  */
#define RCU_I2S1_DIV18                   ADDCTL_I2S1DIV(17)                 /*!< I2S1 input source clock divided by 18  */
#define RCU_I2S1_DIV19                   ADDCTL_I2S1DIV(18)                 /*!< I2S1 input source clock divided by 19  */
#define RCU_I2S1_DIV20                   ADDCTL_I2S1DIV(19)                 /*!< I2S1 input source clock divided by 20  */
#define RCU_I2S1_DIV21                   ADDCTL_I2S1DIV(20)                 /*!< I2S1 input source clock divided by 21  */
#define RCU_I2S1_DIV22                   ADDCTL_I2S1DIV(21)                 /*!< I2S1 input source clock divided by 22  */
#define RCU_I2S1_DIV23                   ADDCTL_I2S1DIV(22)                 /*!< I2S1 input source clock divided by 23  */
#define RCU_I2S1_DIV24                   ADDCTL_I2S1DIV(23)                 /*!< I2S1 input source clock divided by 24  */
#define RCU_I2S1_DIV25                   ADDCTL_I2S1DIV(24)                 /*!< I2S1 input source clock divided by 25  */
#define RCU_I2S1_DIV26                   ADDCTL_I2S1DIV(25)                 /*!< I2S1 input source clock divided by 26  */
#define RCU_I2S1_DIV27                   ADDCTL_I2S1DIV(26)                 /*!< I2S1 input source clock divided by 27  */
#define RCU_I2S1_DIV28                   ADDCTL_I2S1DIV(27)                 /*!< I2S1 input source clock divided by 28  */
#define RCU_I2S1_DIV29                   ADDCTL_I2S1DIV(28)                 /*!< I2S1 input source clock divided by 29  */
#define RCU_I2S1_DIV30                   ADDCTL_I2S1DIV(29)                 /*!< I2S1 input source clock divided by 30  */
#define RCU_I2S1_DIV31                   ADDCTL_I2S1DIV(30)                 /*!< I2S1 input source clock divided by 31  */
#define RCU_I2S1_DIV32                   ADDCTL_I2S1DIV(31)                 /*!< I2S1 input source clock divided by 32  */

