wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_rcu.h
/* PLL0 clock division factor  */
#define ADDCTL_PLL0DIV(regval)           (BITS(8,11) & ((uint32_t)(regval) << 8U))
#define RCU_PLL0_DIV1                    ADDCTL_PLL0DIV(0)                  /*!< PLL0 input source clock divided by 1 */
#define RCU_PLL0_DIV2                    ADDCTL_PLL0DIV(1)                  /*!< PLL0 input source clock divided by 2 */
#define RCU_PLL0_DIV3                    ADDCTL_PLL0DIV(2)                  /*!< PLL0 input source clock divided by 3 */
#define RCU_PLL0_DIV4                    ADDCTL_PLL0DIV(3)                  /*!< PLL0 input source clock divided by 4 */
#define RCU_PLL0_DIV5                    ADDCTL_PLL0DIV(4)                  /*!< PLL0 input source clock divided by 5 */
#define RCU_PLL0_DIV6                    ADDCTL_PLL0DIV(5)                  /*!< PLL0 input source clock divided by 6 */
#define RCU_PLL0_DIV7                    ADDCTL_PLL0DIV(6)                  /*!< PLL0 input source clock divided by 7 */
#define RCU_PLL0_DIV8                    ADDCTL_PLL0DIV(7)                  /*!< PLL0 input source clock divided by 8 */
#define RCU_PLL0_DIV9                    ADDCTL_PLL0DIV(8)                  /*!< PLL0 input source clock divided by 9 */
#define RCU_PLL0_DIV10                   ADDCTL_PLL0DIV(9)                  /*!< PLL0 input source clock divided by 10 */
#define RCU_PLL0_DIV11                   ADDCTL_PLL0DIV(10)                 /*!< PLL0 input source clock divided by 11 */
#define RCU_PLL0_DIV12                   ADDCTL_PLL0DIV(11)                 /*!< PLL0 input source clock divided by 12 */
#define RCU_PLL0_DIV13                   ADDCTL_PLL0DIV(12)                 /*!< PLL0 input source clock divided by 13 */
#define RCU_PLL0_DIV14                   ADDCTL_PLL0DIV(13)                 /*!< PLL0 input source clock divided by 14 */
#define RCU_PLL0_DIV15                   ADDCTL_PLL0DIV(14)                 /*!< PLL0 input source clock divided by 15 */
#define RCU_PLL0_DIV16                   ADDCTL_PLL0DIV(15)                 /*!< PLL0 input source clock divided by 16 */

/* FMC clock division factor  */
#define ADDCTL_FMCDIV(regval)            (BITS(12,15) & ((uint32_t)(regval) << 12U))
#define RCU_FMC_DIV1                     ADDCTL_FMCDIV(0)                   /*!< FMC input source clock divided by 1 */
#define RCU_FMC_DIV2                     ADDCTL_FMCDIV(1)                   /*!< FMC input source clock divided by 2 */
#define RCU_FMC_DIV3                     ADDCTL_FMCDIV(2)                   /*!< FMC input source clock divided by 3 */
#define RCU_FMC_DIV4                     ADDCTL_FMCDIV(3)                   /*!< FMC input source clock divided by 4 */
#define RCU_FMC_DIV5                     ADDCTL_FMCDIV(4)                   /*!< FMC input source clock divided by 5 */
#define RCU_FMC_DIV6                     ADDCTL_FMCDIV(5)                   /*!< FMC input source clock divided by 6 */
#define RCU_FMC_DIV7                     ADDCTL_FMCDIV(6)                   /*!< FMC input source clock divided by 7 */
#define RCU_FMC_DIV8                     ADDCTL_FMCDIV(7)                   /*!< FMC input source clock divided by 8 */
#define RCU_FMC_DIV9                     ADDCTL_FMCDIV(8)                   /*!< FMC input source clock divided by 9 */
#define RCU_FMC_DIV10                    ADDCTL_FMCDIV(9)                   /*!< FMC input source clock divided by 10 */
#define RCU_FMC_DIV11                    ADDCTL_FMCDIV(10)                  /*!< FMC input source clock divided by 11 */
#define RCU_FMC_DIV12                    ADDCTL_FMCDIV(11)                  /*!< FMC input source clock divided by 12 */
#define RCU_FMC_DIV13                    ADDCTL_FMCDIV(12)                  /*!< FMC input source clock divided by 13 */
#define RCU_FMC_DIV14                    ADDCTL_FMCDIV(13)                  /*!< FMC input source clock divided by 14 */
#define RCU_FMC_DIV15                    ADDCTL_FMCDIV(14)                  /*!< FMC input source clock divided by 15 */
#define RCU_FMC_DIV16                    ADDCTL_FMCDIV(15)                  /*!< FMC input source clock divided by 16 */

/* I2S2 clock division factor  */
#define ADDCTL_I2S2DIV(regval)           (BITS(18,22) & ((uint32_t)(regval) << 18U))
#define RCU_I2S2_DIV1                    ADDCTL_I2S2DIV(0)                  /*!< I2S2 input source clock divided by 1  */
#define RCU_I2S2_DIV2                    ADDCTL_I2S2DIV(1)                  /*!< I2S2 input source clock divided by 2  */
#define RCU_I2S2_DIV3                    ADDCTL_I2S2DIV(2)                  /*!< I2S2 input source clock divided by 3  */
#define RCU_I2S2_DIV4                    ADDCTL_I2S2DIV(3)                  /*!< I2S2 input source clock divided by 4  */
#define RCU_I2S2_DIV5                    ADDCTL_I2S2DIV(4)                  /*!< I2S2 input source clock divided by 5  */
#define RCU_I2S2_DIV6                    ADDCTL_I2S2DIV(5)                  /*!< I2S2 input source clock divided by 6  */
#define RCU_I2S2_DIV7                    ADDCTL_I2S2DIV(6)                  /*!< I2S2 input source clock divided by 7  */
#define RCU_I2S2_DIV8                    ADDCTL_I2S2DIV(7)                  /*!< I2S2 input source clock divided by 8  */
#define RCU_I2S2_DIV9                    ADDCTL_I2S2DIV(8)                  /*!< I2S2 input source clock divided by 9  */
#define RCU_I2S2_DIV10                   ADDCTL_I2S2DIV(9)                  /*!< I2S2 input source clock divided by 10  */
#define RCU_I2S2_DIV11                   ADDCTL_I2S2DIV(10)                 /*!< I2S2 input source clock divided by 11  */
#define RCU_I2S2_DIV12                   ADDCTL_I2S2DIV(11)                 /*!< I2S2 input source clock divided by 12  */
#define RCU_I2S2_DIV13                   ADDCTL_I2S2DIV(12)                 /*!< I2S2 input source clock divided by 13  */
#define RCU_I2S2_DIV14                   ADDCTL_I2S2DIV(13)                 /*!< I2S2 input source clock divided by 14  */
#define RCU_I2S2_DIV15                   ADDCTL_I2S2DIV(14)                 /*!< I2S2 input source clock divided by 15  */
#define RCU_I2S2_DIV16                   ADDCTL_I2S2DIV(15)                 /*!< I2S2 input source clock divided by 16  */
#define RCU_I2S2_DIV17                   ADDCTL_I2S2DIV(16)                 /*!< I2S2 input source clock divided by 17  */
#define RCU_I2S2_DIV18                   ADDCTL_I2S2DIV(17)                 /*!< I2S2 input source clock divided by 18  */
#define RCU_I2S2_DIV19                   ADDCTL_I2S2DIV(18)                 /*!< I2S2 input source clock divided by 19  */
#define RCU_I2S2_DIV20                   ADDCTL_I2S2DIV(19)                 /*!< I2S2 input source clock divided by 20  */
#define RCU_I2S2_DIV21                   ADDCTL_I2S2DIV(20)                 /*!< I2S2 input source clock divided by 21  */
#define RCU_I2S2_DIV22                   ADDCTL_I2S2DIV(21)                 /*!< I2S2 input source clock divided by 22  */
#define RCU_I2S2_DIV23                   ADDCTL_I2S2DIV(22)                 /*!< I2S2 input source clock divided by 23  */
#define RCU_I2S2_DIV24                   ADDCTL_I2S2DIV(23)                 /*!< I2S2 input source clock divided by 24  */
#define RCU_I2S2_DIV25                   ADDCTL_I2S2DIV(24)                 /*!< I2S2 input source clock divided by 25  */
#define RCU_I2S2_DIV26                   ADDCTL_I2S2DIV(25)                 /*!< I2S2 input source clock divided by 26  */
#define RCU_I2S2_DIV27                   ADDCTL_I2S2DIV(26)                 /*!< I2S2 input source clock divided by 27  */
#define RCU_I2S2_DIV28                   ADDCTL_I2S2DIV(27)                 /*!< I2S2 input source clock divided by 28  */
#define RCU_I2S2_DIV29                   ADDCTL_I2S2DIV(28)                 /*!< I2S2 input source clock divided by 29  */
#define RCU_I2S2_DIV30                   ADDCTL_I2S2DIV(29)                 /*!< I2S2 input source clock divided by 30  */
#define RCU_I2S2_DIV31                   ADDCTL_I2S2DIV(30)                 /*!< I2S2 input source clock divided by 31  */
#define RCU_I2S2_DIV32                   ADDCTL_I2S2DIV(31)                 /*!< I2S2 input source clock divided by 32  */

/* FMC clock source selection */
#define ADDCTL_FMCSEL(regval)            (BITS(1,2) & ((uint32_t)(regval) << 1U))
#define RCU_FMC_CK_AHB                   ADDCTL_FMCSEL(0)                   /*!< CK_AHB clock selected as source clock of FMC */
#define RCU_FMC_CK_SYS                   ADDCTL_FMCSEL(1)                   /*!< CK_SYS clock selected as source clock of FMC */
#define RCU_FMC_CK_PLL0                  ADDCTL_FMCSEL(2)                   /*!< CK_PLL0 clock selected as source clock of FMC */
#define RCU_FMC_CK_PLL1                  ADDCTL_FMCSEL(3)                   /*!< CK_PLL1 clock selected as source clock of FMC */

/* PLL0 input clock source selection */
#define CFG1_PLL0SEL(regval)             (BITS(20,21) & ((uint32_t)(regval) << 20U))
#define RCU_PLL0SRC_IRC8M                CFG1_PLL0SEL(0)                    /*!< IRC8M clock selected as source clock of PLL0 */
#define RCU_PLL0SRC_IRC48M               CFG1_PLL0SEL(1)                    /*!< IRC48M clock selected as source clock of PLL0 */
#define RCU_PLL0SRC_HXTAL                CFG1_PLL0SEL(2)                    /*!< HXTAL clock selected as source clock of PLL0 */
#define RCU_PLL0SRC_CKPLL1               CFG1_PLL0SEL(3)                    /*!< CKPLL1 clock selected as source clock of PLL0 */

/* PLL1 input clock source selection */
#define RCU_PLL1SRC_HXTAL                ((uint32_t)0x00000000U)            /*!< HXTAL selected as PLL1 input source clock */
#define RCU_PPLL1SRC_IRC48M              RCU_CFG1_PLL1SEL                   /*!< IRC48M selected as PLL1 input source clock */

/* I2S1 clock source selection */
#define RCU_I2S1SRC_CKSYS               ((uint32_t)0x00000000U)             /*!< system clock selected as I2S1 source clock */
#define RCU_I2S1SRC_CKPLL1               RCU_CFG1_I2S1SEL                   /*!< CK_PLL1 selected as I2S1 source clock */

/* I2S2 clock source selection */
#define RCU_I2S2SRC_CKSYS               ((uint32_t)0x00000000U)             /*!< system clock selected as I2S2 source clock */
#define RCU_I2S2SRC_CKPLL1               RCU_CFG1_I2S2SEL                   /*!< CK_PLL1 selected as I2S2 source clock */

/* deep-sleep mode voltage */
#define DSV_DSLPVS(regval)              (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define RCU_DEEPSLEEP_V_0               DSV_DSLPVS(0)                      /*!< core voltage is default value in deep-sleep mode */
#define RCU_DEEPSLEEP_V_1               DSV_DSLPVS(1)                      /*!< core voltage is (default value-0.05)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_2               DSV_DSLPVS(2)                      /*!< core voltage is (default value-0.1)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_3               DSV_DSLPVS(3)                      /*!< core voltage is (default value-0.15)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_4               DSV_DSLPVS(4)                      /*!< core voltage is (default value-0.2)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_5               DSV_DSLPVS(5)                      /*!< core voltage is (default value-0.25)V in deep-sleep mode */
#define RCU_DEEPSLEEP_V_6               DSV_DSLPVS(6)                      /*!< core voltage is (default value-0.3)V in deep-sleep mode(customers are not recommended to use it) */
#define RCU_DEEPSLEEP_V_7               DSV_DSLPVS(7)                      /*!< core voltage is (default value-0.35)V in deep-sleep mode(customers are not recommended to use it) */

/* when enter deep-sleep mode, switch to IRC8M clock and wait the SWDLY IRC8M counter and then enter deep-sleep mode */
#define RCU_SWDLY_COUNT(regval)         (BITS(16,20) & ((uint32_t)(regval) << 16U))

/* PLL0 bandwith configuration */
#define PLL0_BW_CFG(regval)             (BITS(0,3) & ((uint32_t)(regval) << 0U))
/* PLL1 bandwith configuration */
#define PLL1_BW_CFG(regval)             (BITS(8,11) & ((uint32_t)(regval) << 8U))

/* IRC64M clock frequency monitor configuration */
#define CKFMCFG0_IRC8MCKFMC(range)      (BITS(1,2) & ((uint32_t)(range) << 1U))
#define RCU_IRC8MCKFMC_5_PERCENT        CKFMCFG0_IRC8MCKFMC(0)             /*!< the IRC8M clock frequency monitoring range is ±5% */
#define RCU_IRC8MCKFMC_10_PERCENT       CKFMCFG0_IRC8MCKFMC(1)             /*!< the IRC8M clock frequency monitoring range is ±10% */
#define RCU_IRC8MCKFMC_15_PERCENT       CKFMCFG0_IRC8MCKFMC(2)             /*!< the IRC8M clock frequency monitoring range is ±15% */
#define RCU_IRC8MCKFMC_20_PERCENT       CKFMCFG0_IRC8MCKFMC(3)             /*!< the IRC8M clock frequency monitoring range is ±20% */

