wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_rcu.h
/* 48MHz clock selection */
#define RCU_CK48MSRC_CKPLL0             ((uint32_t)0x00000000U)            /*!< use CK_PLL0 clock */
#define RCU_CK48MSRC_IRC48M             RCU_ADDCTL_CK48MSEL                /*!< select IRC48M clock */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check delay before switch to IRC8M clock and enter deep-sleep mode */
#define NOT_RCU_SWITCH_DELAY(irc8m_cnt)             ((irc8m_cnt) == 0U)
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* peripherals clock and reset configure functions */
/* deinitialize the RCU */
void rcu_deinit(void);
/* enable the peripherals clock */
void rcu_periph_clock_enable(rcu_periph_enum periph);
/* disable the peripherals clock */
void rcu_periph_clock_disable(rcu_periph_enum periph);
/* enable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph);
/* disable the peripherals clock when sleep mode */
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph);
/* reset the peripherals */
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset);
/* disable reset the peripherals */
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset);
/* reset the BKP domain */
void rcu_bkp_reset_enable(void);
/* disable the BKP domain reset */
void rcu_bkp_reset_disable(void);

/* system and peripherals clock source, system reset configure functions */
/* configure the system clock source */
void rcu_system_clock_source_config(uint32_t ck_sys);
/* get the system clock source */
uint32_t rcu_system_clock_source_get(void);
/* configure the AHB clock prescaler selection */
void rcu_ahb_clock_config(uint32_t ck_ahb);
/* configure the APB1 clock prescaler selection */
void rcu_apb1_clock_config(uint32_t ck_apb1);
/* configure the APB2 clock prescaler selection */
void rcu_apb2_clock_config(uint32_t ck_apb2);
/* configure the CK_OUT clock source */
void rcu_ckout_config(uint32_t ckout_src);
/* configure the PLL0 clock */
void rcu_pll0_config(uint32_t pll0_src, uint32_t pll0_mul, uint32_t pll0_div);
/* configure the PLL1 clock */
void rcu_pll1_config(uint32_t pll1_src, uint32_t pll1_mul);
/* configure the PREDIV0 division factor */
void rcu_prediv0_config(uint32_t prediv0_div);
/* configure the PREDIV1 division factor */
void rcu_prediv1_config(uint32_t prediv1_div);
/* configure the ADC prescaler factor */
void rcu_adc_clock_config(uint32_t adc_psc);
/* configure the USBFS prescaler factor */
void rcu_usb_clock_config(uint32_t usb_psc);
/* configure the RTC clock source selection */
void rcu_rtc_clock_config(uint32_t rtc_clock_source);
/* configure the I2S1 clock source selection */
void rcu_i2s1_clock_config(uint32_t i2s_clock_source, uint32_t i2s_clock_div);
/* configure the I2S2 clock source selection */
void rcu_i2s2_clock_config(uint32_t i2s_clock_source, uint32_t i2s_clock_div);
/* configure the CK48M clock source selection */
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source);
/* configure the FMC clock source selection */
void rcu_fmc_clock_config(uint32_t fmc_clock_source, uint32_t fmc_clock_div);

/* LXTAL, IRC8M, IRC40K and other oscillator configure functions */
/* configure the LXTAL drive capability */
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap);
/* wait for oscillator stabilization flags is SET or oscillator startup is timeout */
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci);
/* turn on the oscillator */
void rcu_osci_on(rcu_osci_type_enum osci);
/* turn off the oscillator */
void rcu_osci_off(rcu_osci_type_enum osci);
/* enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci);
/* disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it */
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci);
/* set the IRC8M adjust value */
void rcu_irc8m_adjust_value_set(uint32_t irc8m_adjval);

/* clock monitor configure functions */
/* enable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_enable(void);
/* disable the HXTAL clock monitor */
void rcu_hxtal_clock_monitor_disable(void);
/*enable the LXTAL clock monitor */
void rcu_lxtal_clock_monitor_enable(void);
/* disable the LXTAL clock monitor */
void rcu_lxtal_clock_monitor_disable(void);

/* clock frequency monitor configure functions */
/* enable the clock frequency monitor */
void rcu_clock_freq_monitor_enable(rcu_ckfm_enum ckfm);
/* disable the clock frequency monitor */
void rcu_clock_freq_monitor_disable(rcu_ckfm_enum ckfm);
/* IRC8M clock frequency monitor range configuration */
void rcu_irc8m_freq_monitor_config(uint32_t range);
/* HXTAL clock frequency monitor threshold configuration */
void rcu_hxtal_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold);
/* PLL0P clock frequency monitor threshold configuration */
void rcu_pll0p_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold);
/* PLL1 clock frequency monitor threshold configuration */
void rcu_pll1_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold);

/* voltage configure functions */
/* set the deep sleep mode voltage */
void rcu_deepsleep_voltage_set(uint32_t dsvol);
/* delay before switch to IRC8M clock and enter deep-sleep mode */
void rcu_deepsleep_switch_delay_set(uint32_t irc8m_cnt);

/* lock rcu register */
void rcu_reg_lock(void);
/* unlock rcu register */
void rcu_reg_unlock(void);
/* config PLL0/PLL1 bandwidth */
void rcu_pll_bandwidth_config(uint32_t pll0_bw, uint32_t pll1_bw);

/* clock frequency get functions */
/* get the system clock, bus and peripheral clock frequency */
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock);

/* flag & interrupt functions */
/* get the clock stabilization, peripheral reset and clock frequency failure flags */
FlagStatus rcu_flag_get(rcu_flag_enum flag);
/* clear clock frequency failure flags */
void rcu_flag_clear(rcu_flag_clear_enum flag);
/* clear all the reset flag */
void rcu_all_reset_flag_clear(void);
/* enable the clock interrupt */
void rcu_interrupt_enable(rcu_int_enum interrupt);
/* disable the clock interrupt */
void rcu_interrupt_disable(rcu_int_enum interrupt);
/* get the clock interrupt flags */
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag);
/* clear the clock interrupt flags */
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag);

#endif /* GD32F50X_RCU_H */
